combine, re-arrange (#18)
* combine, re-arrange

* remove

* move arch out
